[
    {
      "id": 1,
      "nombre": "Como cliente, quiero poder registrarme y crear una cuenta en la plataforma para realizar compras y acceder a mi historial de pedidos",
      "justificacion": "Es una US bastante común en el desarrollo de software y no presenta una problemática difícil de abordar.",
      "puntos": 2,
      "esfuerzo": "Medio",
      "complejidad": "Media",
      "incertidumbre": "Baja"
    },
    {
      "id": 2,
      "nombre": "Como cliente, quiero actualizar mi información personal y de contacto para asegurarme de que mis datos estén correctos",
      "justificacion": "La US tiene una menor complejidad posible para su realización e implementación.",
      "puntos": 1,
      "esfuerzo": "Medio",
      "complejidad": "Baja",
      "incertidumbre": "Baja"
    },
    {
      "id": 3,
      "nombre": "Como cliente, quiero recuperar mi contraseña en caso de olvido para acceder nuevamente a mi cuenta",
      "justificacion": "Requiere tiempo para investigar aspectos de seguridad y control de cuentas para recuperación y reenvío de contraseñas.",
      "puntos": 3,
      "esfuerzo": "Medio",
      "complejidad": "Media",
      "incertidumbre": "Media"
    },
    {
      "id": 4,
      "nombre": "Como cliente que se preocupa por su privacidad, quiero que mi sesión en la aplicación esté protegida contra intentos de suplantación o secuestro de sesión.",
      "justificacion": "La implementación requiere técnicas avanzadas como tokens de sesión seguros y autenticación de dos pasos.",
      "puntos": 5,
      "esfuerzo": "Alto",
      "complejidad": "Alta",
      "incertidumbre": "Media"
    },
    {
      "id": 5,
      "nombre": "Como administrador de la aplicación, quiero poder gestionar los roles de usuario y sus permisos correspondientes.",
      "puntos": 5,
      "esfuerzo": "Alto",
      "complejidad": "Alta",
      "incertidumbre": "Media"
    },
    {
      "id": 6,
      "nombre": "Como auditor de seguridad, quiero revisar un registro detallado de todas las actividades relacionadas con el inicio de sesión y eventos sensibles.",
      "puntos": 5,
      "esfuerzo": "Medio",
      "complejidad": "Media",
      "incertidumbre": "Media"
    },
    {
      "id": 7,
      "nombre": "Como administrador, quiero poder agregar, modificar y eliminar productos al catálogo para mantener actualizado el inventario.",
      "puntos": 3,
      "esfuerzo": "Medio",
      "complejidad": "Media",
      "incertidumbre": "Media"
    },
    {
      "id": 8,
      "nombre": "Como cliente, quiero agregar productos a mi carrito de compras y proceder al pago para completar mi compra.",
      "puntos": 3,
      "esfuerzo": "Bajo",
      "complejidad": "Media",
      "incertidumbre": "Media"
    },
    {
      "id": 9,
      "nombre": "Como cliente, quiero seleccionar mi método de pago y envío preferido para finalizar mi pedido.",
      "puntos": 4,
      "esfuerzo": "Medio",
      "complejidad": "Media",
      "incertidumbre": "Media"
    }
  ]
  